<?php

declare(strict_types=1);

return [
    'reset' => 'आपका पासवर्ड बदला जा चुका है।',
    'sent' => 'हमने आपका पासवर्ड रीसेट लिंक ईमेल कर दिया है।',
    'throttled' => 'कृपया पुनः प्रयास करने से पहले प्रतीक्षा करें.',
    'token' => 'यह पासवर्ड रीसेट टोकन अमान्य है.',
    'user' => 'हमें उस ईमेल पते वाला कोई उपयोगकर्ता नहीं मिल सका।',
    'notification' => [
        'subject' => 'अपना :app पासवर्ड रीसेट करें',
        'reason' => 'आपको यह ईमेल इसलिए प्राप्त हो रहा है क्योंकि हमें आपके खाते के लिए पासवर्ड रीसेट अनुरोध प्राप्त हुआ है।',
        'action' => 'नया पासवर्ड चुनें',
        'expiry' => 'यह लिंक :minutes मिनट में समाप्त हो जाता है।',
        'ignore' => 'यदि आपने अपना पासवर्ड रीसेट करने के लिए नहीं कहा है, तो आप इस ईमेल को अनदेखा कर सकते हैं; आपका पासवर्ड वही रहता है.',
    ],
];
