<?php

declare(strict_types=1);

return [
    'email_verification' => [
        'subject' => 'メールアドレスを確認してください',
        'reason' => '過去の注文を確認してデータをダウンロードできるように、これがあなたの電子メール アドレスであることを確認してください。',
        'action' => 'メールを確認してください',
        'expiry' => 'このリンクは 1 回だけ機能し、:hours 時間で期限切れになります。',
        'ignore' => 'アカウントを作成していない場合は、このメールを無視してください。',
    ],
    'email_change' => [
        'subject' => '新しいメールアドレスを確認してください',
        'reason' => 'このアドレスをアカウントに使用するよう依頼されました。変更を行うには、サインイン中にこのリンクを開いてください。',
        'action' => 'このメールを使用してください',
        'expiry' => 'このリンクは 1 回だけ機能し、:minutes 分で期限切れになります。',
        'ignore' => 'あなたがこれを要求していない場合は、このメールを無視して構いません。何も変わりません。',
    ],
    'marketing_consent' => [
        'email' => ':store からのニュースやオファーを電子メールで送ってください。いつでも購読を解除できます。',
        'sms' => ':store からのニュースやオファーをテキスト メッセージで送ってください。いつでも購読を解除できます。',
    ],
    'email_changed' => [
        'subject' => 'アカウントのメールアドレスが変更されました',
        'reason' => 'アカウントの電子メール アドレスが変更され、他のすべてのデバイスがサインアウトされました。アカウントに関するメールは新しいアドレスに送信されます。',
        'help' => 'この変更を行っていない場合は、すぐにストアに連絡してください。',
    ],
];
