<?php

declare(strict_types=1);

return [
    'reset' => 'パスワードがリセットされました。',
    'sent' => 'パスワードリセットリンクを電子メールで送信しました。',
    'throttled' => '再試行する前にお待ちください。',
    'token' => 'このパスワード リセット トークンは無効です。',
    'user' => 'そのメール アドレスを持つユーザーが見つかりません。',
    'notification' => [
        'subject' => ':app パスワードをリセットします',
        'reason' => 'このメールは、アカウントのパスワード リセット リクエストを受け取ったためにお送りしています。',
        'action' => '新しいパスワードを選択してください',
        'expiry' => 'このリンクは :minutes 分で期限切れになります。',
        'ignore' => 'パスワードのリセットを要求していない場合は、このメールを無視してかまいません。パスワードは変わりません。',
    ],
];
